work_reports/wp1/srs/srs.org
#    -*- mode: org -*-

#+STARTUP: hideblocks    
#+LATEX_HEADER: \renewcommand{\maketitle}{}
#+LATEX_HEADER: \setlength\parindent{24pt}
#+LATEX_HEADER: \usepackage[margin=1.25in]{geometry}
#+LATEX_HEADER: \usepackage{indentfirst}
#+LATEX_HEADER: \usepackage{fancyhdr} \pagestyle{fancyplain}
#+LATEX_HEADER: \lhead{North Shore Rail Extension}
#+OPTIONS: toc:nil

#+begin_latex

\begin{titlepage}
    \begin{center}
        \vspace*{1cm}
        
        \Huge
        \textbf{North Shore Rail Extension}

        \vspace{2.5cm}
        \textbf{Software Requirements Specification \\}
        \vspace{2.5cm}
        \textbf{Low-Comotivation}
        \vspace{2.5cm}

    \end{center}

    \begin{flushright}        
        \Large
        Prepared By: Zach Scheider \\\ Demetri Khoury \\
        Christen Reinbeck \\ Max Reno \\ Andrew Lendacky
        \\ Michael Ghaben
    \end{flushright}        

        \vfill
    \begin{center}        
        
        \vspace{0.8cm}        

        \Large
        COE1186 – Software Engineering\\
        Instructor: Joseph A Profeta III, Ph.D.\\
        Spring 2017
        
    \end{center}
\end{titlepage}

#+end_latex

#+TOC: headlines 3
\cleardoublepage

* Introduction
** Purpose
   The purpose of this systems requirement specifications document is to provide a detailed description of the requirements for the "North Shore Rail Extension" software. It will declare the requirements and system constraints for the development of the system. It will describe the interface and the communications and interactions between the modules. This document will explain the development intentions to the customer and provide a reference for the team to refer to while building the project.

** Scope

The "North Shore Rail Extension" software designed here is to control a rail system in Pittsburgh. It will run on a Windows machine as a .jar file. 

With this software, users are able to interact with the  system as a whole as well as with individual modules for testing purposes.

Testing consoles are built in to each module in order to see how each works on its own.

In order to accurately test that all pieces are working correctly, and without actual implementation, virtual models for both the track and train are simulated.
** Definitions
| Term               | Definition                                             |
|--------------------+--------------------------------------------------------|
|                    | <54>                                                   |
| User               | Person(s) that interact with the system                |
| Module             | Self-contained piece of the larger program             |
| Train Model        | Train represented through software                     |
| Track Model        | Software representation of the track                   |
| Train Controller   | Allows interfacing with train controls                 |
| Wayside Controller | Vital programmable logic controller for the track      |
| CTC Office         | Central Train Control Office (CTC Office)              |
|                    | Central office that monitors and routes trains         |
| MBO                | Moving Block Overlay (MBO)                             |
|                    | Generates train and driver schedules, and allows for   |
|                    | trains to operate in moving block overlay mode         |
| Vital              | A safety critical component                            |
| Segment            | A piece of the track consisting of one or more blocks  |
| Block              | A piece of a segment                                   |

** References

\noindent
[[https://google.github.io/styleguide/javaguide.html][Google Java Style Guide]] \\

\noindent
Documents provided on COE1186 Courseweb page \\

\noindent
IEEE. IEEE Std 830-1998 IEEE Recommended Practice for Software Requirements Specifications. IEEE Computer Society, 1998. \\

\noindent
[[https://github.com/michaelghaben/ece1186][Lo-Comotivation Git Repository]]

** Overview
   The next section provides an overall description of the system, its functionality, constraints, and interaction with other systems. This will be broken down into subsections, one for each module. 

   The third section provides specific requirements for each module. This will show the products functionality.

* Overall description
** Perspective
This self-contained product consists of the following six modules: the CTC Office, Scheduler/MBO, the Wayside Controller/Track Controller, Track Model, Train Model, and the Train Controller. These six modules are designed to run together in order to simulate the function of a fully-developed train control system. However, the Track Model and Train Model are strictly for testing purposes. They will be switched for an actual track and train when this is to be implemented. 

** Functions
The "North Shore Rail Extension" has the overall function of operating a transit system distributed among six modules. The CTC office acts as the control center for the system. It has the ability to dispatch trains and alter switches on the track while in manual mode. The MBO creates schedules for the drivers and the trains. It also is the responsible for moving block overlay mode, which replaces the fixed block operating mode. The Track Controller determines the positions of the switches and crossings, and is where the PLC is programmed. The Track Model simulates the track. It determines if a block is occupied or not. The Train Controller is responsible for operating the speed of the train, the air conditioning, doors and lights. The Train Model simulates a train on the track. It attempts to approximate the physics of an actual train which is reflected in the speed.

The program will be able to simulate several different types of failures such as; track failures, engine failures, and the antennae failure.

** User Characteristics
The dispatch communicates with the rest of the system through the CTC Office. This user must be able to operate the CTC Office, dispatch trains, interpret the track schedule, and handle failure states. 

The wayside engineer operates the track from the Wayside Controller. They must know how to write PLC code to dictate the functionality of track blocks. They must also know how to act to handle failure states. 

The transit operator uses the Train Controller to navigate the route according to the schedule. This user should have a good working knowledge of the train controls and the train schedule and know the correct procedures of operation for what to do in an emergency.

The passenger is able to operate the emergency brake, which is located on each train.

A test user will be able to test the functionality of all six modules. They will be able to test certain scenarios specific to an individual module.  

** Constraints
1. The system shall be submitted as an executable.
2. The executable should be able to run on Windows 10.
3. Each module will have a Graphical User Interface (GUI) for ease of use.
4. The system must be adaptable for different track layouts.
5. The system is a safety critical application.

** Assumptions and Dependencies
The program is assumed to be running on a Windows machine with JDK 8 installed.

The modules are only able to communicate with certain other modules. They must follow the specified communication path.
** Apportioning of Requirements

The requirements will be implemented in the order of more critical components will be implemented first.

For more information, see the work schedule document.
* Specific Requirements
** Functional Requirements
*** Central Train Control Office
**** Trains
