work_reports/wp1/srs/srs.tex
\section{Specific Requirements}
\label{sec-3}
\subsection{Functional Requirements}
\label{sec-3-1}
\subsubsection{Central Train Control Office}
\label{sec-3-1-1}
\begin{enumerate}
\item Trains
\label{sec-3-1-1-1}
\begin{enumerate}
\item Routing
\label{sec-3-1-1-1-1}

A dispatcher should be able to create a route of a train.
\begin{enumerate}
\item Exact sequence of operations
\label{sec-3-1-1-1-1-1}

A dispatcher will press the button "Dispatch Train" and it will propagate a pop up window where he/she can select a line, speed and authority.

This will then dispatch a train from the yard.
\item Communication facilities
\label{sec-3-1-1-1-1-2}

Need info from wayside about blocks in order to maintain a fixed block type of schedule.
\item Error handling and recovery
\label{sec-3-1-1-1-1-3}

Deny a train from being dispatched if block it is entering is not free.
\item Relationship of output to input
\label{sec-3-1-1-1-1-4}

A dispatcher inputs line, speed and authority for a train to then leave the yard.
\end{enumerate}
\item Scheduling
\label{sec-3-1-1-1-2}

A dispatcher should be able to choose the type of schedule, automatic and manual, MBO and fixed block. 
\begin{enumerate}
\item Exact sequence of operations
\label{sec-3-1-1-1-2-1}

A dispatcher will choose will either choose Automatic or Manual mode for the schedule.

If Automatic is chosen, then dispatcher can choose between MBO and Fixed Block modes.

If Manual is chosen, then dispatcher is responsible for manually dispatching trains from the yard.
\item Responses to abnormal situations
\label{sec-3-1-1-1-2-2}

If communication between MBO and CTC is severed, then the dispatcher will then be notified to dispatch trains via manual mode.
\item Communication facilitates
\label{sec-3-1-1-1-2-3}

The actual schedule is received from the MBO.
\item Relationship of output to inputs
\label{sec-3-1-1-1-2-4}

Depending on the mode of schedule input by the dispatcher, it will affect how trains are being directed around the track.
\end{enumerate}
\item Monitoring
\label{sec-3-1-1-1-3}

The office should monitor current block statuses as well as the speed and authority of any train on the track.
\begin{enumerate}
\item Exact sequence of operations
\label{sec-3-1-1-1-3-1}

There are two separate sections which will display either information about a chosen block or a chosen train per the dispatchers choices in the interface.
\item Responses to abnormal situations
\label{sec-3-1-1-1-3-2}

If communication between the CTC and wayside controller is severed, trains may operate as usual as they can still obtain a schedule or operate in manual mode on their own. However, the CTC will not be able to see any info about the blocks/trains.
\item Communication facilities
\label{sec-3-1-1-1-3-3}

All track/block information as well as the speed/authority/GPS location of trains comes from the wayside controller.
\item Relationship of output to inputs
\label{sec-3-1-1-1-3-4}

A dispatcher will enter either a specific line/segment/block or train and then receive information corresponding to that piece.
\end{enumerate}
\end{enumerate}
\item Track Segment
\label{sec-3-1-1-2}
\begin{enumerate}
\item Open/Close Tracks
\label{sec-3-1-1-2-1}

The dispatcher should be able to close a block for maintenance, as well as dispatch maintenance to a certain block.
\begin{enumerate}
\item Exact sequence of operations
\label{sec-3-1-1-2-1-1}

The dispatcher will be alerted to a failure via the far left color-changing block. In the track section of the interface, a dispatcher can select a line/segment/block. Then he/she can select the "Close Track" button followed by the "Send Maintenance" button. Sending maintenance will fix the block and automatically reopen the block.
\item Responses to abnormal situations
\label{sec-3-1-1-2-1-2}

Should a failure occur, the dispatcher will close and repair a block.
\item Communication facilities
\label{sec-3-1-1-2-1-3}

The wayside controller will be communicating track failures to the CTC.
\item Relationship of output to inputs
\label{sec-3-1-1-2-1-4}

When a dispatcher sends out maintenance/closes a block, then trains will not be allowed to enter this block until it is fixed.
\end{enumerate}
\end{enumerate}
\item Authority/Speed
\label{sec-3-1-1-3}

The office can determine each train's authority/speed.
\begin{enumerate}
\item Exact sequence of operations
\label{sec-3-1-1-3-1}

In the train portion of the interface, a dispatcher can select the "Authority" button or "Speed" button which will propagate a pop up window. In this window, a dispatcher can input the authority in feet, as well as check which train they are assigning this authority to.
\item Communication facilities
\label{sec-3-1-1-3-2}

The authority is sent from the CTC to the wayside controller.
\item Relationship of output to inputs
\label{sec-3-1-1-3-3}

This indirectly effects the trains speed/authority. The CTC communicates with the wayside who in turn communicates with other members of the communication path.
\end{enumerate}
\item System Display
\label{sec-3-1-1-4}

The office should display information about the entire transit system. Including: train speed/authority, track block status, throughput, switch direction, railway crossing status, light status, track/train failures.
\begin{enumerate}
\item Exact sequence of operations
\label{sec-3-1-1-4-1}

Upon selecting a certain block or train, information from the wayside controller will be displayed.
\item Communication facilities
\label{sec-3-1-1-4-2}

The wayside controller provides the CTC with this information.
\end{enumerate}
\item Communication
\label{sec-3-1-1-5}
\begin{enumerate}
\item Inputs
\label{sec-3-1-1-5-1}
\begin{enumerate}
\item Schedule
\label{sec-3-1-1-5-1-1}
\begin{enumerate}
\item From where?
\label{sec-3-1-1-5-1-1-1}

MBO
\item Used for?
\label{sec-3-1-1-5-1-1-2}

Displaying to dispatcher.
\end{enumerate}
\item Track Information/failures
\label{sec-3-1-1-5-1-2}
\begin{enumerate}
\item From where?
\label{sec-3-1-1-5-1-2-1}

Wayside controller
\item Used for?
\label{sec-3-1-1-5-1-2-2}

Displaying to dispatcher.
\end{enumerate}
\item Train Information/failures
\label{sec-3-1-1-5-1-3}
\begin{enumerate}
\item From where?
\label{sec-3-1-1-5-1-3-1}

Wayside controller/MBO
\item Used for?
\label{sec-3-1-1-5-1-3-2}

Displaying Speed/Authority to dispatcher.
\end{enumerate}
\end{enumerate}
\item Outputs
\label{sec-3-1-1-5-2}
\begin{enumerate}
\item Automatic versus Manual Mode (also MBO versus fixed if automatic is chosen)
\label{sec-3-1-1-5-2-1}
\begin{enumerate}
\item To where?
\label{sec-3-1-1-5-2-1-1}

Wayside controller/MBO
\item Used for?
\label{sec-3-1-1-5-2-1-2}

Given to wayside controller to then communicate to trains. 

Given to MBO to decide which kind of schedule is being run.
\end{enumerate}
\item Close Track/Send Maintenance
\label{sec-3-1-1-5-2-2}
\begin{enumerate}
\item To where?
\label{sec-3-1-1-5-2-2-1}

Wayside controller
\item Used for?
\label{sec-3-1-1-5-2-2-2}

Shutting down a block of track so that trains cannot travel on it.
\end{enumerate}
\item Speed/Authority
\label{sec-3-1-1-5-2-3}
\begin{enumerate}
\item To where?
\label{sec-3-1-1-5-2-3-1}

Wayside Controller
\item Used for?
\label{sec-3-1-1-5-2-3-2}

Giving a suggestion of speed and authority to wayside to communicate to trains.
\end{enumerate}
\item Dispatch Train (when in manual)
\label{sec-3-1-1-5-2-4}
\begin{enumerate}
\item To where?
\label{sec-3-1-1-5-2-4-1}

Wayside Controller
\item Used for?
\label{sec-3-1-1-5-2-4-2}

When in manual mode, and acting outside of a schedule, the dispatcher can dispatch trains from the yard.
\end{enumerate}
\end{enumerate}
\end{enumerate}
\end{enumerate}
\subsubsection{Wayside Controller}
\label{sec-3-1-2}
\begin{enumerate}
\item Display
\label{sec-3-1-2-1}
\begin{enumerate}
\item CTC Display
\label{sec-3-1-2-1-1}

A list of trains and their speed and authorities from the CTC will be displayed.
\begin{enumerate}
\item Exact sequence of operations
\label{sec-3-1-2-1-1-1}

Values communicated to wayside unit, displayed on console.
\item Communication facilities
\label{sec-3-1-2-1-1-2}

CTC
\item Formulas for input to output conversion
\label{sec-3-1-2-1-1-3}

Units shown will be calculated in metric as given/supplied and converted to imperial for display.
\end{enumerate}
\item Track Model Display
\label{sec-3-1-2-1-2}

A list of blocks, select-able by line and segment, will be display with relevant information.
\begin{enumerate}
\item Communication facilities
\label{sec-3-1-2-1-2-1}

Track Model
\item Formulas for input to output conversion
\label{sec-3-1-2-1-2-2}

Units shown will be calculated in metric as given/supplied and converted to imperial for display.
\end{enumerate}
\item Message Board
\label{sec-3-1-2-1-3}
