work_reports/wp1/srs/srs.org
***** Message Board

Relevant information that doesn't apply to other two displays will appear here, such as debugging statuses, failure notices, syntax errors in PLC code.
****** Formulas for input to output conversion

Units shown will be calculated in metric as given/supplied and converted to imperial for display.
**** Control
***** PLC

The user will be able to load in a PLC program, supplying a file path or browsing for the file.
****** Validity checks on inputs

File not found or does not exist.

PLC file contains errors or is not valid.
****** Exact sequence of operations

User loads in file, and once loaded, PLC unit controls state of track using Boolean logic to determine signals to send to track model components.
****** Relationship of output to inputs

Outputs will vary on inputs from the CTC and Track Model.
****** Input/Output sequences

PLC unit will take in speed/authority suggestions from CTC, as well as block occupancy and associated block information (lights, crossings, etc) from track model.
***** Testing

A test console will be available for the user to simulate (for testing/debugging purposes) inputs coming into the wayside unit to observe its behavior.
****** Exact sequence of operations

User opens test console, fixes desired track & train info, and clicks "OK" to give wayside specified information.
**** Communication
***** Inputs
****** Speed/Authority Suggestion
******* From where?

CTC
******* Checks to do

Make sure it is a valid suggestion.
******* Used for?

Setting speed/authority of desired train.
****** Block Occupancy
******* From where?

Track Model
******* Used for?

Determining occupied/unoccupied sections of track.
****** Railroad Crossing Status
******* From where?

Track Model
******* Used for?

Determining active/inactive railroad crossings.
****** Switch Status
******* From where?

Track Model
******* Used for?

Determining position of a switch.
****** Lights Status
******* From where?

Track Model
******* Used for?

Determining active/inactive lights.
****** Track Heater Status
******* From where?

Track Model
******* Used for?

Determining on/off status of track heaters.
***** Outputs
****** Track State
******* To where?

CTC
******* Used for?

Displaying light status, switch status, railroad crossing status, block occupancy, and other information about block to the Dispatcher.
****** Track State Manipulations
******* To where?

Track Model
******* Checks to do

PLC code will determine outputs to change state of track.
******* Used for?

Sending signals to track model in order to change the direction of a switch, turn on or off a light, activate/deactivate a railroad crossing, set speed/authority for a train.
*** Track Model
**** Grade and Elevation

The track model should consider grade and elevation that is contained in the excel file provided by the user.
***** Exact sequence of operations

The track model initializes. The track model then receives signal
***** Communication facilities

The track model will provide accessors and mutators to the rest of the modules for communication. 

It will provide scripts to read the excel files. 

It will assume responsible behavior by the connected modules (e.g. modules that should not access data will not)
***** Effect of parameters

Different train inputs will result in different outputs.
***** Input/Output sequences

The input to the track model is an excel file.
***** Formulas for input to output conversion

Convert km to miles.
**** Model Configuration

The track model should be able to be configured through user input.
**** Track Configuration

The track track layout should be able to configured through user input.
***** Validity checks on inputs

There are no validity checks on the input. It is assumed that the track results in a complete loop.
***** Exact sequence of operations

The track initializes a Python script that reads the excel file into a serializable format such as JSON or protobuf. It then reads the serialized data into the Java run-time environment and plots the map. Additionally, it will parse the relevant data and store them in a structure for mutability by other components.
***** Communication facilities

Will provide accessors and constructors to communicate with other parts.
***** Error handling and recovery

It is assumed that the inputs to the track model are valid and will not be checked. This is due to the track model being dropped out at the end of the project for a physical model.
***** Relationship of output to inputs

The various parameters imputed by the excel file (grade, length, etc.) will results in different tracks being rendered and loaded into the program.
***** Input/Output sequences

Takes in excel file. Outputs track models.
***** Formulas for input to output conversion

1m = 3.3 ft
**** Block Configuration

The tracks block size should be able to edited.
**** Signals and Switches

The track model should have visible signals and switch machines. These will be shown in the visual region.
**** Presence Detection

The track model should detect whether or not a train is currently on the block.
***** Exact sequence of operations

Presence detection will be done via the signals sent from the track circuit.
***** Communication facilities

The track model will contain the ability to determine the occupancy of a specific grouping of blocks when called by an external program.
***** Relationship of output to inputs

The track model will receive a signal from the track circuit on the occupancy of a specific block. The track model will output the occupancy of the block for use by the wayside controller.
**** Railway Crossings

The Track Model should take railway crossings into account.
***** Exact sequence of operations

The track model receives a setting of either "up" or "down" for railway crossings and adjusts model parameters accordingly.
***** Communication facilities

Has an input for the wayside controller to toggle the railway crossings.
***** Effect of parameters

A 1 signifies that the railway crossing is up

A 0 signifies that the railway crossing is down.
***** Relationship of output to inputs

The track model sets the railway crossing to up or down.
**** Loading/Unloading People

The track model should populate stations with the number of people loading onto the train and ensure that the passengers on a train doesn't exceed the maximum.
The number of people leaving each train should be sent to the track model from the train model.
