work_reports/wp1/srs/srs.tex

Relevant information that doesn't apply to other two displays will appear here, such as debugging statuses, failure notices, syntax errors in PLC code.
\begin{enumerate}
\item Formulas for input to output conversion
\label{sec-3-1-2-1-3-1}

Units shown will be calculated in metric as given/supplied and converted to imperial for display.
\end{enumerate}
\end{enumerate}
\item Control
\label{sec-3-1-2-2}
\begin{enumerate}
\item PLC
\label{sec-3-1-2-2-1}

The user will be able to load in a PLC program, supplying a file path or browsing for the file.
\begin{enumerate}
\item Validity checks on inputs
\label{sec-3-1-2-2-1-1}

File not found or does not exist.

PLC file contains errors or is not valid.
\item Exact sequence of operations
\label{sec-3-1-2-2-1-2}

User loads in file, and once loaded, PLC unit controls state of track using Boolean logic to determine signals to send to track model components.
\item Relationship of output to inputs
\label{sec-3-1-2-2-1-3}

Outputs will vary on inputs from the CTC and Track Model.
\item Input/Output sequences
\label{sec-3-1-2-2-1-4}

PLC unit will take in speed/authority suggestions from CTC, as well as block occupancy and associated block information (lights, crossings, etc) from track model.
\end{enumerate}
\item Testing
\label{sec-3-1-2-2-2}

A test console will be available for the user to simulate (for testing/debugging purposes) inputs coming into the wayside unit to observe its behavior.
\begin{enumerate}
\item Exact sequence of operations
\label{sec-3-1-2-2-2-1}

User opens test console, fixes desired track \& train info, and clicks "OK" to give wayside specified information.
\end{enumerate}
\end{enumerate}
\item Communication
\label{sec-3-1-2-3}
\begin{enumerate}
\item Inputs
\label{sec-3-1-2-3-1}
\begin{enumerate}
\item Speed/Authority Suggestion
\label{sec-3-1-2-3-1-1}
\begin{enumerate}
\item From where?
\label{sec-3-1-2-3-1-1-1}

CTC
\item Checks to do
\label{sec-3-1-2-3-1-1-2}

Make sure it is a valid suggestion.
\item Used for?
\label{sec-3-1-2-3-1-1-3}

Setting speed/authority of desired train.
\end{enumerate}
\item Block Occupancy
\label{sec-3-1-2-3-1-2}
\begin{enumerate}
\item From where?
\label{sec-3-1-2-3-1-2-1}

Track Model
\item Used for?
\label{sec-3-1-2-3-1-2-2}

Determining occupied/unoccupied sections of track.
\end{enumerate}
\item Railroad Crossing Status
\label{sec-3-1-2-3-1-3}
\begin{enumerate}
\item From where?
\label{sec-3-1-2-3-1-3-1}

Track Model
\item Used for?
\label{sec-3-1-2-3-1-3-2}

Determining active/inactive railroad crossings.
\end{enumerate}
\item Switch Status
\label{sec-3-1-2-3-1-4}
\begin{enumerate}
\item From where?
\label{sec-3-1-2-3-1-4-1}

Track Model
\item Used for?
\label{sec-3-1-2-3-1-4-2}

Determining position of a switch.
\end{enumerate}
\item Lights Status
\label{sec-3-1-2-3-1-5}
\begin{enumerate}
\item From where?
\label{sec-3-1-2-3-1-5-1}

Track Model
\item Used for?
\label{sec-3-1-2-3-1-5-2}

Determining active/inactive lights.
\end{enumerate}
\item Track Heater Status
\label{sec-3-1-2-3-1-6}
\begin{enumerate}
\item From where?
\label{sec-3-1-2-3-1-6-1}

Track Model
\item Used for?
\label{sec-3-1-2-3-1-6-2}

Determining on/off status of track heaters.
\end{enumerate}
\end{enumerate}
\item Outputs
\label{sec-3-1-2-3-2}
\begin{enumerate}
\item Track State
\label{sec-3-1-2-3-2-1}
\begin{enumerate}
\item To where?
\label{sec-3-1-2-3-2-1-1}

CTC
\item Used for?
\label{sec-3-1-2-3-2-1-2}

Displaying light status, switch status, railroad crossing status, block occupancy, and other information about block to the Dispatcher.
\end{enumerate}
\item Track State Manipulations
\label{sec-3-1-2-3-2-2}
\begin{enumerate}
\item To where?
\label{sec-3-1-2-3-2-2-1}

Track Model
\item Checks to do
\label{sec-3-1-2-3-2-2-2}

PLC code will determine outputs to change state of track.
\item Used for?
\label{sec-3-1-2-3-2-2-3}

Sending signals to track model in order to change the direction of a switch, turn on or off a light, activate/deactivate a railroad crossing, set speed/authority for a train.
\end{enumerate}
\end{enumerate}
\end{enumerate}
\end{enumerate}
\subsubsection{Track Model}
\label{sec-3-1-3}
\begin{enumerate}
\item Grade and Elevation
\label{sec-3-1-3-1}

The track model should consider grade and elevation that is contained in the excel file provided by the user.
\begin{enumerate}
\item Exact sequence of operations
\label{sec-3-1-3-1-1}

The track model initializes. The track model then receives signal
\item Communication facilities
\label{sec-3-1-3-1-2}

The track model will provide accessors and mutators to the rest of the modules for communication. 

It will provide scripts to read the excel files. 

It will assume responsible behavior by the connected modules (e.g. modules that should not access data will not)
\item Effect of parameters
\label{sec-3-1-3-1-3}

Different train inputs will result in different outputs.
\item Input/Output sequences
\label{sec-3-1-3-1-4}

The input to the track model is an excel file.
\item Formulas for input to output conversion
\label{sec-3-1-3-1-5}

Convert km to miles.
\end{enumerate}
\item Model Configuration
\label{sec-3-1-3-2}

The track model should be able to be configured through user input.
\item Track Configuration
\label{sec-3-1-3-3}

The track track layout should be able to configured through user input.
\begin{enumerate}
\item Validity checks on inputs
\label{sec-3-1-3-3-1}

There are no validity checks on the input. It is assumed that the track results in a complete loop.
\item Exact sequence of operations
\label{sec-3-1-3-3-2}

The track initializes a Python script that reads the excel file into a serializable format such as JSON or protobuf. It then reads the serialized data into the Java run-time environment and plots the map. Additionally, it will parse the relevant data and store them in a structure for mutability by other components.
\item Communication facilities
\label{sec-3-1-3-3-3}

Will provide accessors and constructors to communicate with other parts.
\item Error handling and recovery
\label{sec-3-1-3-3-4}

It is assumed that the inputs to the track model are valid and will not be checked. This is due to the track model being dropped out at the end of the project for a physical model.
\item Relationship of output to inputs
\label{sec-3-1-3-3-5}

The various parameters imputed by the excel file (grade, length, etc.) will results in different tracks being rendered and loaded into the program.
\item Input/Output sequences
\label{sec-3-1-3-3-6}

Takes in excel file. Outputs track models.
\item Formulas for input to output conversion
\label{sec-3-1-3-3-7}

1m = 3.3 ft
\end{enumerate}
\item Block Configuration
\label{sec-3-1-3-4}

The tracks block size should be able to edited.
\item Signals and Switches
\label{sec-3-1-3-5}

The track model should have visible signals and switch machines. These will be shown in the visual region.
\item Presence Detection
\label{sec-3-1-3-6}

The track model should detect whether or not a train is currently on the block.
\begin{enumerate}
\item Exact sequence of operations
\label{sec-3-1-3-6-1}

Presence detection will be done via the signals sent from the track circuit.
\item Communication facilities
\label{sec-3-1-3-6-2}

The track model will contain the ability to determine the occupancy of a specific grouping of blocks when called by an external program.
\item Relationship of output to inputs
\label{sec-3-1-3-6-3}

The track model will receive a signal from the track circuit on the occupancy of a specific block. The track model will output the occupancy of the block for use by the wayside controller.
\end{enumerate}
\item Railway Crossings
\label{sec-3-1-3-7}

The Track Model should take railway crossings into account.
\begin{enumerate}
\item Exact sequence of operations
\label{sec-3-1-3-7-1}

The track model receives a setting of either "up" or "down" for railway crossings and adjusts model parameters accordingly.
\item Communication facilities
\label{sec-3-1-3-7-2}

Has an input for the wayside controller to toggle the railway crossings.
\item Effect of parameters
\label{sec-3-1-3-7-3}

A 1 signifies that the railway crossing is up

A 0 signifies that the railway crossing is down.
\item Relationship of output to inputs
\label{sec-3-1-3-7-4}

The track model sets the railway crossing to up or down.
\end{enumerate}
\item Loading/Unloading People
\label{sec-3-1-3-8}

The track model should populate stations with the number of people loading onto the train and ensure that the passengers on a train doesn't exceed the maximum.
The number of people leaving each train should be sent to the track model from the train model.
\begin{enumerate}
\item Exact sequence of operations
\label{sec-3-1-3-8-1}
