work_reports/wp1/srs/srs.org
***** Exact sequence of operations

Receives input to load people onto train.

Draws a random number taking time into account  and loads returns the passengers on to the train.
***** Communication facilities

Sends a message to the train model to add people to the train.
***** Effect of parameters

Adds people to the train.
**** Track Heaters

The track model should have heaters located at each station.
***** Exact sequence of operations

Turns track heaters on if the temperature (in F) is less than 32. Turns them off otherwise.
***** Relationship of output to inputs

If the temperature is below a threshold, the track heaters are turned on. Else, they are turned off
**** Failure Modes
***** Broken Rail
****** What does it mean?

That a rail has been broken or damaged in a way to throw an error.
****** When does it occur?

When something breaks. This will be simulated randomly.
****** Which modules are affected?

All of the modules, either directly or indirectly.
****** How do you recover?

CTC sends a repair crew to fix the broken rail.
***** Track Circuit Failure
****** What does it mean?

The track circuit has been broken.
****** When does it occur?

When the track circuit connections are disconnected at a physical level. This can occur in situations such as vandalism.
****** Which modules are affected?

All modules, either directly or indirectly. The track must function.
****** How do you recover?

CTC sends a repair crew to fix the track circuit failure.
***** Power Failure
****** What does it mean?

The track loses power.
****** When does it occur?

When the track power supply fails.
****** Which modules are affected?

All modules that require the track to be functioning are affected.
****** How do you recover?

CTC sends a repair crew to fix the track power failure.
*** Train Model
**** Calculate Physics
***** Power Command

Calculate the correct amount of power to supply in order to achieve the correct speed.
****** Validity checks on inputs

The power command obtained as input from the train controller, will be verified to be greater than or equal to 0. 

The trains cannot operate in reverse therefore the set speed assigned by the train controller must either be setting the train to a positive speed or telling the train to stop (power command of 0).
****** Exact sequence of operations

The train controller will set a speed for the train to follow. This speed will either be set by the driver (in manual mode) or the wayside (in automatic mode).
This set speed will then be converted into a power command based on the current velocity of the train and the speed desired by the controller. 

The corresponding power command will be sent to the train controller and using internal calculations of the train model the set speed for the train will be met.
****** Responses to abnormal situations

If there is any sort of failure in the system that effects the train model, the power command will be overridden and set to 0. This will cause the service brakes to activate to slow down the train whenever possible.
****** Communication facilitates

The current velocity will be obtained from the train model and passed on to the train controller.

The power command based on current velocity will be communicated back from the train controller to the train model.
****** Error handling and recovery

Any sort of error or failure will result in the activation of the service or emergency brakes in order to bring the train to a complete stop. 

The recovery process will require the CTC to send maintenance to recover the train and resolve the error.
****** Effect of parameters

The parameters that will be used for this calculation include current velocity, power command, mass, and acceleration/deceleration rates.

The only parameter that will change in this scenario is the current velocity of the train model.
****** Relationship of output to inputs

The output of the train controller will be a power command to meet the set speed assigned in the module and this will translate into an input to the train model.

The output of the train model will be the current velocity derived from this calculation and will translate into an input passed back to the train controller.
****** Input/Output sequences

If the power command results in a larger speed than the current velocity, the train will accelerate to meet the set speed by the train controller.

If the power command results in a speed lower than the current velocity, the train will decelerate to meet the set speed by the train controller.

If the power command results in a speed of zero the service brakes will be applied until the train comes to a full stop.
***** Current Velocity 

Calculate the current velocity of the train in observation.
****** Validity checks on inputs

The current velocity of the train must be a positive value as the trains in this system can not operate in reverse.

The input to calculate the current velocity will be the power command setting the set-point speed for the train and this value will be verified as detailed above.
****** Exact sequence of operations

The Power command input from the train controller will be taken into the train model computation sequence.

The current velocity will be computed based on the error between the new set speed and the current speed.

This velocity will be based on mass, acceleration, and friction on the track.
****** Responses to abnormal situations

If there is any sort of failure in the system that effects the train model, the current velocity will be decreased to 0 as the train comes to a full stop.
****** Communication facilitates

The current velocity will be computed in the train model and passed on to the train controller.

The train controller will use the current velocity to compute the required power command to send back to the train model to meet the set speed of the train.
****** Error handling and recovery

Any sort of error or failure will result in the activation of the service or emergency brakes in order to bring the train to a complete stop. 

The recovery process will require the CTC to send maintenance to recover the train and resolve the error.
****** Effect of parameters

The parameters that will be used for this calculation include power command, mass, and acceleration/deceleration rates.

The only parameter that will change in this scenario is the current velocity of the train model.
****** Relationship of output to inputs

The output of the train controller will be a power command to meet the set speed assigned in the module and this will translate into an input to the train model.

The output of the train model will be the current velocity derived from this calculation and will translate into an input passed back to the train controller.
