work_reports/wp1/srs/srs.tex

Receives input to load people onto train.

Draws a random number taking time into account  and loads returns the passengers on to the train.
\item Communication facilities
\label{sec-3-1-3-8-2}

Sends a message to the train model to add people to the train.
\item Effect of parameters
\label{sec-3-1-3-8-3}

Adds people to the train.
\end{enumerate}
\item Track Heaters
\label{sec-3-1-3-9}

The track model should have heaters located at each station.
\begin{enumerate}
\item Exact sequence of operations
\label{sec-3-1-3-9-1}

Turns track heaters on if the temperature (in F) is less than 32. Turns them off otherwise.
\item Relationship of output to inputs
\label{sec-3-1-3-9-2}

If the temperature is below a threshold, the track heaters are turned on. Else, they are turned off
\end{enumerate}
\item Failure Modes
\label{sec-3-1-3-10}
\begin{enumerate}
\item Broken Rail
\label{sec-3-1-3-10-1}
\begin{enumerate}
\item What does it mean?
\label{sec-3-1-3-10-1-1}

That a rail has been broken or damaged in a way to throw an error.
\item When does it occur?
\label{sec-3-1-3-10-1-2}

When something breaks. This will be simulated randomly.
\item Which modules are affected?
\label{sec-3-1-3-10-1-3}

All of the modules, either directly or indirectly.
\item How do you recover?
\label{sec-3-1-3-10-1-4}

CTC sends a repair crew to fix the broken rail.
\end{enumerate}
\item Track Circuit Failure
\label{sec-3-1-3-10-2}
\begin{enumerate}
\item What does it mean?
\label{sec-3-1-3-10-2-1}

The track circuit has been broken.
\item When does it occur?
\label{sec-3-1-3-10-2-2}

When the track circuit connections are disconnected at a physical level. This can occur in situations such as vandalism.
\item Which modules are affected?
\label{sec-3-1-3-10-2-3}

All modules, either directly or indirectly. The track must function.
\item How do you recover?
\label{sec-3-1-3-10-2-4}

CTC sends a repair crew to fix the track circuit failure.
\end{enumerate}
\item Power Failure
\label{sec-3-1-3-10-3}
\begin{enumerate}
\item What does it mean?
\label{sec-3-1-3-10-3-1}

The track loses power.
\item When does it occur?
\label{sec-3-1-3-10-3-2}

When the track power supply fails.
\item Which modules are affected?
\label{sec-3-1-3-10-3-3}

All modules that require the track to be functioning are affected.
\item How do you recover?
\label{sec-3-1-3-10-3-4}

CTC sends a repair crew to fix the track power failure.
\end{enumerate}
\end{enumerate}
\end{enumerate}
\subsubsection{Train Model}
\label{sec-3-1-4}
\begin{enumerate}
\item Calculate Physics
\label{sec-3-1-4-1}
\begin{enumerate}
\item Power Command
\label{sec-3-1-4-1-1}

Calculate the correct amount of power to supply in order to achieve the correct speed.
\begin{enumerate}
\item Validity checks on inputs
\label{sec-3-1-4-1-1-1}

The power command obtained as input from the train controller, will be verified to be greater than or equal to 0. 

The trains cannot operate in reverse therefore the set speed assigned by the train controller must either be setting the train to a positive speed or telling the train to stop (power command of 0).
\item Exact sequence of operations
\label{sec-3-1-4-1-1-2}

The train controller will set a speed for the train to follow. This speed will either be set by the driver (in manual mode) or the wayside (in automatic mode).
This set speed will then be converted into a power command based on the current velocity of the train and the speed desired by the controller. 

The corresponding power command will be sent to the train controller and using internal calculations of the train model the set speed for the train will be met.
\item Responses to abnormal situations
\label{sec-3-1-4-1-1-3}

If there is any sort of failure in the system that effects the train model, the power command will be overridden and set to 0. This will cause the service brakes to activate to slow down the train whenever possible.
\item Communication facilitates
\label{sec-3-1-4-1-1-4}

The current velocity will be obtained from the train model and passed on to the train controller.

The power command based on current velocity will be communicated back from the train controller to the train model.
\item Error handling and recovery
\label{sec-3-1-4-1-1-5}

Any sort of error or failure will result in the activation of the service or emergency brakes in order to bring the train to a complete stop. 

The recovery process will require the CTC to send maintenance to recover the train and resolve the error.
\item Effect of parameters
\label{sec-3-1-4-1-1-6}

The parameters that will be used for this calculation include current velocity, power command, mass, and acceleration/deceleration rates.

The only parameter that will change in this scenario is the current velocity of the train model.
\item Relationship of output to inputs
\label{sec-3-1-4-1-1-7}

The output of the train controller will be a power command to meet the set speed assigned in the module and this will translate into an input to the train model.

The output of the train model will be the current velocity derived from this calculation and will translate into an input passed back to the train controller.
\item Input/Output sequences
\label{sec-3-1-4-1-1-8}

If the power command results in a larger speed than the current velocity, the train will accelerate to meet the set speed by the train controller.

If the power command results in a speed lower than the current velocity, the train will decelerate to meet the set speed by the train controller.

If the power command results in a speed of zero the service brakes will be applied until the train comes to a full stop.
\end{enumerate}
\item Current Velocity
\label{sec-3-1-4-1-2}

Calculate the current velocity of the train in observation.
\begin{enumerate}
\item Validity checks on inputs
\label{sec-3-1-4-1-2-1}

The current velocity of the train must be a positive value as the trains in this system can not operate in reverse.

The input to calculate the current velocity will be the power command setting the set-point speed for the train and this value will be verified as detailed above.
\item Exact sequence of operations
\label{sec-3-1-4-1-2-2}

The Power command input from the train controller will be taken into the train model computation sequence.

The current velocity will be computed based on the error between the new set speed and the current speed.

This velocity will be based on mass, acceleration, and friction on the track.
\item Responses to abnormal situations
\label{sec-3-1-4-1-2-3}

If there is any sort of failure in the system that effects the train model, the current velocity will be decreased to 0 as the train comes to a full stop.
\item Communication facilitates
\label{sec-3-1-4-1-2-4}

The current velocity will be computed in the train model and passed on to the train controller.

The train controller will use the current velocity to compute the required power command to send back to the train model to meet the set speed of the train.
\item Error handling and recovery
\label{sec-3-1-4-1-2-5}

Any sort of error or failure will result in the activation of the service or emergency brakes in order to bring the train to a complete stop. 

The recovery process will require the CTC to send maintenance to recover the train and resolve the error.
\item Effect of parameters
\label{sec-3-1-4-1-2-6}

The parameters that will be used for this calculation include power command, mass, and acceleration/deceleration rates.

The only parameter that will change in this scenario is the current velocity of the train model.
\item Relationship of output to inputs
\label{sec-3-1-4-1-2-7}

The output of the train controller will be a power command to meet the set speed assigned in the module and this will translate into an input to the train model.

The output of the train model will be the current velocity derived from this calculation and will translate into an input passed back to the train controller.
\item Input/Output sequences
\label{sec-3-1-4-1-2-8}

If the power command is larger than the current speed the current velocity will increase to match the set speed for the train.

If the power command is smaller than the current speed the current velocity will decrease to match the set speed for the train.
