work_reports/wp1/srs/srs.org
****** Input/Output sequences

If the power command is larger than the current speed the current velocity will increase to match the set speed for the train.

If the power command is smaller than the current speed the current velocity will decrease to match the set speed for the train.

If the power command calls for a stop the current velocity will be decreased to bring the train to a complete stop before continuing.

***** Safe Braking Distance

Calculate the safe braking distance for the train (Service and emergency). 
****** Validity checks on inputs

If the trains Authority obtained from the track model is smaller than or equal to the safe braking distance of the train, the train will apply the service brakes to bring the train to a full stop until a new authority is passed to the train model.
****** Exact sequence of operations

The train model will take in the number of passengers on-board and compute the total mass of the train including passenger weight. 

The maximum deceleration for each type of brake will be used to compute the safe braking distance based on the current speed and weight of the train.

The safe braking distance will then be compared to the current authority and if it exceeds the authority of the train it will cause the service brakes to engage. 
****** Responses to abnormal situations

There are some abnormal situations that may arise that would effect the safe braking distance, such as a system failure, or a sudden change in authority. 

The response to any abnormal situation will always be to engage the service or emergency brakes and stop the train as soon as possible. 
****** Communication facilities

The safe braking distance will be calculated using data stored in the train model and will be compared to the authority sent from the track model.
****** Error handling and recovery

Any sort of error or failure will result in the activation of the service or emergency brakes in order to bring the train to a complete stop. 

The recovery process will require the CTC to send maintenance to recover the train and resolve the error.
****** Effect of parameters

The parameters that will be used for this calculation include total mass, Authority, and maximum deceleration. 

The only parameter that will change in this scenario is the safe braking distance of the train model.
****** Relationship of output to inputs

The output of this calculation will be used as a test case for authority within the train model, before increasing or decreasing speed to satisfy a power command.
****** Input/Output sequences

The Authority will be input to the train model via the track model and this input will be passed into the safe braking distance calculation. 

Based on the mass and current speed the safe braking distance will be computed by the train model and compared to the authority.

An output verifying that the authority is larger than the safe braking distance will be passed out through the system to the further part of the calculation. 
**** Communication

A major role of the train model is to display train data and statuses based on inputs and outputs required to be displayed on to the user. 
***** Inputs

Various inputs will be passed into the train model and will be used for calculations or as status displays for the user.
****** Power Command
******* Used for?

The power command will be used to determine what speed to increase or decrease the train to. This power command will be computed in the train controller based on the set speed and the current velocity of the train.
******* Checks to do

The train model will check that the power command is a positive value which either increases or decreases the current velocity of the train. If the value is less than the current velocity, the train will decelerate to the set speed. 
If the power command is greater than the current velocity, the train will accelerate to the set speed.
******* From where?

The power command input will be sent to the train model from the train controller module.
****** Authority
******* Used for?

The authority of the train will be passed to the train model to display to the user how fair the train can travel before its required to stop. 

This value will be used as a to verify the safe braking distance of the train model.
******* Checks to do

The authority will be checked to verify that the distance is greater than the safe braking distance of the train to ensure there will not be a problem with continuing at the current speed.
******* From where?

The authority will be assigned by the track controller and passed to the train model via the train controller 
****** Right/Left Door Status
******* Used for?

The status of the left and right doors will be displayed as part of the train model interface. 

This input will be set to open, closed , or failure based on the state of each set of doors. 

The doors will be opened at each station to allow passengers to embark and closed while train is in operation.
******* Checks to do

The status of the doors will be checked to be open or closed and this value will be displayed to the console. 

A status change can be passed onto the train model and this will be changed to match on the display.

The door status will be checked for a failure status and this will also be displayed on the console in place of open or closed.
******* From where?

In manual mode the driver will operate the closing and opening of doors and the input will be received from the train controller.

In automatic mode the train controller will automatically open and close doors at arrival and departure at each station.
****** Interior Light Status
******* Used for?

The status of the interior lights will be displayed as part of the train model interface. 

This input will be set to on,off, or failure based on the state of the lights. 
******* Checks to do

The status of the lights will be checked to be on or off and this value will be displayed to the console. 

A status change can be passed onto the train model and this will be changed to match on the display.

The interior light status will be checked for a failure status and this will also be displayed on the console in place of on or off.
******* From where?

The interior lights will be controlled by the train controller and the input changing the status will be sent to the train model.
****** Temperature/Thermostat Status
******* Used for?

The current temperature of the train will be monitored by the train and this value will be set by the internal testing system.

The thermostat setting will also be displayed on the train model to meet the needs of the train. 

The thermostat will be used to increase or decrease on-board temperature based on the current temp.
******* Checks to do

The thermostat setting will be checked to be a valid positive value.

If the thermostat setting is larger than the current temperature the temperature will be increased to match.

If the thermostat setting is larger than the current temperature, the temperature will be decreased to match.
******* From where?

The thermostat input will be send via the train controller to the train model.

In manual mode the driver will  set the thermostat setting using the train controller interface.

In automatic mode the train controller will automatically adjust the thermostat to keep the train at the ideal temperature programmed by the system.
****** Service/Emergency Brakes
