work_reports/wp1/srs/srs.tex

If the power command calls for a stop the current velocity will be decreased to bring the train to a complete stop before continuing.
\end{enumerate}

\item Safe Braking Distance
\label{sec-3-1-4-1-3}

Calculate the safe braking distance for the train (Service and emergency). 
\begin{enumerate}
\item Validity checks on inputs
\label{sec-3-1-4-1-3-1}

If the trains Authority obtained from the track model is smaller than or equal to the safe braking distance of the train, the train will apply the service brakes to bring the train to a full stop until a new authority is passed to the train model.
\item Exact sequence of operations
\label{sec-3-1-4-1-3-2}

The train model will take in the number of passengers on-board and compute the total mass of the train including passenger weight. 

The maximum deceleration for each type of brake will be used to compute the safe braking distance based on the current speed and weight of the train.

The safe braking distance will then be compared to the current authority and if it exceeds the authority of the train it will cause the service brakes to engage. 
\item Responses to abnormal situations
\label{sec-3-1-4-1-3-3}

There are some abnormal situations that may arise that would effect the safe braking distance, such as a system failure, or a sudden change in authority. 

The response to any abnormal situation will always be to engage the service or emergency brakes and stop the train as soon as possible. 
\item Communication facilities
\label{sec-3-1-4-1-3-4}

The safe braking distance will be calculated using data stored in the train model and will be compared to the authority sent from the track model.
\item Error handling and recovery
\label{sec-3-1-4-1-3-5}

Any sort of error or failure will result in the activation of the service or emergency brakes in order to bring the train to a complete stop. 

The recovery process will require the CTC to send maintenance to recover the train and resolve the error.
\item Effect of parameters
\label{sec-3-1-4-1-3-6}

The parameters that will be used for this calculation include total mass, Authority, and maximum deceleration. 

The only parameter that will change in this scenario is the safe braking distance of the train model.
\item Relationship of output to inputs
\label{sec-3-1-4-1-3-7}

The output of this calculation will be used as a test case for authority within the train model, before increasing or decreasing speed to satisfy a power command.
\item Input/Output sequences
\label{sec-3-1-4-1-3-8}

The Authority will be input to the train model via the track model and this input will be passed into the safe braking distance calculation. 

Based on the mass and current speed the safe braking distance will be computed by the train model and compared to the authority.

An output verifying that the authority is larger than the safe braking distance will be passed out through the system to the further part of the calculation.
\end{enumerate}
\end{enumerate}
\item Communication
\label{sec-3-1-4-2}

A major role of the train model is to display train data and statuses based on inputs and outputs required to be displayed on to the user. 
\begin{enumerate}
\item Inputs
\label{sec-3-1-4-2-1}

Various inputs will be passed into the train model and will be used for calculations or as status displays for the user.
\begin{enumerate}
\item Power Command
\label{sec-3-1-4-2-1-1}
\begin{enumerate}
\item Used for?
\label{sec-3-1-4-2-1-1-1}

The power command will be used to determine what speed to increase or decrease the train to. This power command will be computed in the train controller based on the set speed and the current velocity of the train.
\item Checks to do
\label{sec-3-1-4-2-1-1-2}

The train model will check that the power command is a positive value which either increases or decreases the current velocity of the train. If the value is less than the current velocity, the train will decelerate to the set speed. 
If the power command is greater than the current velocity, the train will accelerate to the set speed.
\item From where?
\label{sec-3-1-4-2-1-1-3}

The power command input will be sent to the train model from the train controller module.
\end{enumerate}
\item Authority
\label{sec-3-1-4-2-1-2}
\begin{enumerate}
\item Used for?
\label{sec-3-1-4-2-1-2-1}

The authority of the train will be passed to the train model to display to the user how fair the train can travel before its required to stop. 

This value will be used as a to verify the safe braking distance of the train model.
\item Checks to do
\label{sec-3-1-4-2-1-2-2}

The authority will be checked to verify that the distance is greater than the safe braking distance of the train to ensure there will not be a problem with continuing at the current speed.
\item From where?
\label{sec-3-1-4-2-1-2-3}

The authority will be assigned by the track controller and passed to the train model via the train controller
\end{enumerate}
\item Right/Left Door Status
\label{sec-3-1-4-2-1-3}
\begin{enumerate}
\item Used for?
\label{sec-3-1-4-2-1-3-1}

The status of the left and right doors will be displayed as part of the train model interface. 

This input will be set to open, closed , or failure based on the state of each set of doors. 

The doors will be opened at each station to allow passengers to embark and closed while train is in operation.
\item Checks to do
\label{sec-3-1-4-2-1-3-2}

The status of the doors will be checked to be open or closed and this value will be displayed to the console. 

A status change can be passed onto the train model and this will be changed to match on the display.

The door status will be checked for a failure status and this will also be displayed on the console in place of open or closed.
\item From where?
\label{sec-3-1-4-2-1-3-3}

In manual mode the driver will operate the closing and opening of doors and the input will be received from the train controller.

In automatic mode the train controller will automatically open and close doors at arrival and departure at each station.
\end{enumerate}
\item Interior Light Status
\label{sec-3-1-4-2-1-4}
\begin{enumerate}
\item Used for?
\label{sec-3-1-4-2-1-4-1}

The status of the interior lights will be displayed as part of the train model interface. 

This input will be set to on,off, or failure based on the state of the lights. 
\item Checks to do
\label{sec-3-1-4-2-1-4-2}

The status of the lights will be checked to be on or off and this value will be displayed to the console. 

A status change can be passed onto the train model and this will be changed to match on the display.

The interior light status will be checked for a failure status and this will also be displayed on the console in place of on or off.
\item From where?
\label{sec-3-1-4-2-1-4-3}

The interior lights will be controlled by the train controller and the input changing the status will be sent to the train model.
\end{enumerate}
\item Temperature/Thermostat Status
\label{sec-3-1-4-2-1-5}
\begin{enumerate}
\item Used for?
\label{sec-3-1-4-2-1-5-1}

The current temperature of the train will be monitored by the train and this value will be set by the internal testing system.

The thermostat setting will also be displayed on the train model to meet the needs of the train. 

The thermostat will be used to increase or decrease on-board temperature based on the current temp.
\item Checks to do
\label{sec-3-1-4-2-1-5-2}

The thermostat setting will be checked to be a valid positive value.

If the thermostat setting is larger than the current temperature the temperature will be increased to match.

If the thermostat setting is larger than the current temperature, the temperature will be decreased to match.
\item From where?
\label{sec-3-1-4-2-1-5-3}

The thermostat input will be send via the train controller to the train model.

In manual mode the driver will  set the thermostat setting using the train controller interface.

In automatic mode the train controller will automatically adjust the thermostat to keep the train at the ideal temperature programmed by the system.
\end{enumerate}
\item Service/Emergency Brakes
\label{sec-3-1-4-2-1-6}
\begin{enumerate}
\item Used for?
\label{sec-3-1-4-2-1-6-1}
