work_reports/wp1/srs/srs.tex

The service and emergency brakes will be used to decelerate the train of bring the train to a full stop.

The service brake will be used in typical scenarios where the speed is needed to decrease to be below a speed limit or to come to a halt at the station.

The emergency brake will be used in abnormal situations such as failures or sudden change in authority or drastic drop in speed which will not be met with the deceleration rate of the service brakes.
\item Checks to do
\label{sec-3-1-4-2-1-6-2}

The Service brakes will be checked to be on, off, or in a state of failure. 

If the service brakes are on the train will decelerate as needed to meet the speed set-point of the train.

If the service brakes are in a state of failure the emergency brakes will be used in this scenario.
\item From where?
\label{sec-3-1-4-2-1-6-3}

The service brake status will be sent via the train controller.

In manual mode the driver will engage the service brakes to bring the train to halt. 

In automatic mode the service brakes will engage and disengage automatically to decrease speed or bring the train to a halt at the stations.

The emergency brake input will be sent via the train controller.

The Emergency brake can be engaged either manually by the driver or by any passenger on board.
\end{enumerate}
\end{enumerate}

\item Outputs
\label{sec-3-1-4-2-2}

Various outputs will be recorded and passed out of the train model and will be used internally as well as in other models
\begin{enumerate}
\item Current Velocity
\label{sec-3-1-4-2-2-1}
\begin{enumerate}
\item Used for?
\label{sec-3-1-4-2-2-1-1}

The primary output of the train model is the current velocity of the train. 

This value will be used to compute the power command based on the difference between the current speed and the set-point speed.
\item Checks to do
\label{sec-3-1-4-2-2-1-2}

The model will check that the current velocity is positive and that the power command will either increase or decrease the speed to match the set-point.
\item To where?
\label{sec-3-1-4-2-2-1-3}

The current velocity will be output to the train controller which will use the difference between the current velocity and the set-point speed to determine the power command required.
\end{enumerate}
\item Height/Width
\label{sec-3-1-4-2-2-2}
\begin{enumerate}
\item Used for?
\label{sec-3-1-4-2-2-2-1}

The height and width of the train will be maintained and displayed as part of the train model console.

These values are constant and will be used as reminders for height and width clearance for the train primarily when entering stations or tunnels.
\item Checks to do
\label{sec-3-1-4-2-2-2-2}

These values will never change so the only checks that will be performed is to verify the height of the train will fit below any infrastructure along the track.
\item To where?
\label{sec-3-1-4-2-2-2-3}

This output will be displayed to the train model console and will not be passed to any other system.
\end{enumerate}
\item Length/ number of cars
\label{sec-3-1-4-2-2-3}
\begin{enumerate}
\item Used for?
\label{sec-3-1-4-2-2-3-1}

The length of the train and the number of attached cars will be recorded and monitored by the train model.

These values will be used to track the maximum passenger count allowed as well as how much space the train is taking up on the track.
\item Checks to do
\label{sec-3-1-4-2-2-3-2}

The length of the train will be used primarily in MBO mode when some train may overlap in the same block. This length will be used along with the safe braking distance to minimize failures and train collisions in the system.
\item To where?
\label{sec-3-1-4-2-2-3-3}

The length of the train will be sent to the MBO for tracking train locations and occupancy on the track.
\end{enumerate}
\item Passenger/Crew Count
\label{sec-3-1-4-2-2-4}
\begin{enumerate}
\item Used for?
\label{sec-3-1-4-2-2-4-1}

The number of passengers and crew members on board will be tracked by the train model. This number will be stored by the model and added to as passengers embark on a station and subtracted from as they disembark.

This value will also be used to track the throughput of the train system which will be displayed as part of the CTC module.
\item Checks to do
\label{sec-3-1-4-2-2-4-2}

The output will be checked to verify that the total number of passengers and crew do not exceed the maximum capacity of the train.

Also the check will be made to verify that the number of passengers disembarking does not exceed the number of passengers on board.
\item To where?
\label{sec-3-1-4-2-2-4-3}

The number of passengers on board will be stored and displayed to the train model.

The number will also be output to the CTC to calculate the throughput of the system.
\end{enumerate}
\item Mass
\label{sec-3-1-4-2-2-5}
\begin{enumerate}
\item Used for?
\label{sec-3-1-4-2-2-5-1}

The mass for the train will be recorded and used for all physics calculations within the train model.

This value will be updated based on the train weight and the weight of all passengers on board.
\item Checks to do
\label{sec-3-1-4-2-2-5-2}

The system will check that as passengers embark and disembark the mass will fluctuate accordingly. 
\item To where?
\label{sec-3-1-4-2-2-5-3}

This output will be displayed to the train model console and will not be passed to any other module.
\end{enumerate}
\end{enumerate}
\end{enumerate}
\item Failure Modes
\label{sec-3-1-4-3}

\begin{enumerate}
\item Engine Failure
\label{sec-3-1-4-3-1}
\begin{enumerate}
\item What does it mean?
\label{sec-3-1-4-3-1-1}

An engine failure means there is a loss of power in train engine and as a result is unable to increase speed as requested.
\item When does it occur?
\label{sec-3-1-4-3-1-2}

This occurs when Murphy engages the failure command to activate an engine failure on board the system
\item Which modules are affected?
\label{sec-3-1-4-3-1-3}

The engine failure will directly effect the train model and train controller as this occurs on board the train.

This will also indirectly affect the track model, track controller and CTC as the current block will need to be shut down until restored.
\item How do you recover?
\label{sec-3-1-4-3-1-4}

The train will recover from this failure mode with two steps.

First, the train will come to a full stop as soon as physically possible. This will be performed by the service brakes if possible otherwise the emergency brakes will need to be used.

Next, the CTC is required to send maintenance to the blocked off track to repair the train engine.
\end{enumerate}
\item Brake Failure
\label{sec-3-1-4-3-2}
\begin{enumerate}
\item What does it mean?
\label{sec-3-1-4-3-2-1}

A brake failure means there is a failure state in the service brakes on board the train. 
\item When does it occur?
\label{sec-3-1-4-3-2-2}

This occurs when there is a problem with the braking system. This will be another component controlled by Murphy.
\item Which modules are affected?
\label{sec-3-1-4-3-2-3}

The brake failure will directly effect the train model and train controller as this occurs on board the train.

This will also indirectly affect the track model, track controller and CTC as the current block will need to be shut down until restored.
\item How do you recover?
\label{sec-3-1-4-3-2-4}

The train will recover from this failure mode with two steps.

First, the train will come to a full stop as soon as physically possible. This will be performed by the emergency brakes since the service brakes are out of operation.

Next, the CTC is required to send maintenance to the blocked off track to repair the train.
\end{enumerate}
\item Signal Failure
\label{sec-3-1-4-3-3}
\begin{enumerate}
\item What does it mean?
\label{sec-3-1-4-3-3-1}

The signal failure means there is a failure in the antenna on-board the train and there is loss of communication between the train and the external modules.
\item When does it occur?
\label{sec-3-1-4-3-3-2}

This occurs as a result of Murphy activating the signal failure button to cause this error on board the train.
\item Which modules are affected?
\label{sec-3-1-4-3-3-3}
