work_reports/wp1/srs/srs.tex

The signal failure will directly effect the train model and train controller as this blocks any communication between the two modules.

This will also indirectly affect the track model, track controller and CTC as the current block will need to be shut down until restored.
\item How do you recover?
\label{sec-3-1-4-3-3-4}

The train will recover from this failure mode with two steps.

First, the train will come to a full stop as soon as physically possible. This will be performed by the service brakes if possible otherwise the emergency brakes will need to be used.

Next, the CTC is required to send maintenance to the blocked off track to repair the train.
\end{enumerate}
\end{enumerate}
\end{enumerate}
\subsubsection{Train Controller}
\label{sec-3-1-5}
\begin{enumerate}
\item Decode Track Signal
\label{sec-3-1-5-1}

The signal from the track circuit should be decoded into a speed limit and authority.
\item Safety
\label{sec-3-1-5-2}
\begin{enumerate}
\item Speed Limit
\label{sec-3-1-5-2-1}

The train should be stopped from exceeding the speed limit.
\begin{enumerate}
\item Validity checks on inputs
\label{sec-3-1-5-2-1-1}

If the train is over the accepted speed limit of the block or the suggested speed set by the CTC, the train's service brakes will be applied to slow down the train to the correct speed. 
\item Exact sequence of operations
\label{sec-3-1-5-2-1-2}

When the user selects the train from the list of dispatched trains, the system will check to make sure the speed of the train is less than that of the suggested speed (automatic mode), or the speed of the train is less than the block speed (manual mode).

This will be done by comparing the speed of the train to the suggested speed and block speed found under the Speed Controller and Block Info sections of the Train Controller. 
\item Responses to abnormal situations
\label{sec-3-1-5-2-1-3}

If the service brakes are down on the train, and cannot be applied to slow the train down, the train will use their emergency brakes to come to a complete stop until the service brakes are able to be repaired.  
\item Communication facilities
\label{sec-3-1-5-2-1-4}

Determining the speed of the train comes from the tachometer on the train.

Determining the block speed and the suggested speed comes from the wayside controller and the CTC, respectively. 
\item Relationship of output to inputs
\label{sec-3-1-5-2-1-5}

When the train is selected, the trains speed will be displayed to the Train Controller. If the speed is determined to be faster than required, the brakes on the train will be signaled from the Train Controller to initiate the brakes on the train. 
\item Input/Output sequences
\label{sec-3-1-5-2-1-6}

The speed of the train is determined from the train. If the speed is faster than the desired speed, the brakes are applied until the train's speed meets the speed limit. 
\item Formulas for input to output conversion
\label{sec-3-1-5-2-1-7}

The speed is retrieved as KPH, but needs to be converted to MPH. 1 KPH is equal to 0.621371 MPH.
\end{enumerate}
\item Authority
\label{sec-3-1-5-2-2}

The train should be stopped from exceeding the authority limit.
\begin{enumerate}
\item Validity checks on inputs
\label{sec-3-1-5-2-2-1}

The authority will be checked to make sure that it contains digits (0-9), and does not contain any alphanumeric (A-Z, a-z), and special (\&,*,!,@, etc..) characters.  
\item Exact sequence of operations
\label{sec-3-1-5-2-2-2}

When the authority for the train is received, begin calculating the distance traveled. Once the train reaches the maximum distance, it must then change it's speed to the appropriate speed for the new authority of the block. 
\item Communication facilities
\label{sec-3-1-5-2-2-3}

The authority is decoded by the track and picked up by the train model. 
\item Relationship of output to inputs
\label{sec-3-1-5-2-2-4}

The selected train gives the Train Controller its authority to display. 
\item Formulas for input to output conversion
\label{sec-3-1-5-2-2-5}

Computes the fraction of the distance traveled to the total authority distance, and signals when the fraction equals 1. 

The authority is retrieved in meters, but needs to be converted to miles (mi). 1 m is equal to 0.000621371 mi.
\end{enumerate}
\end{enumerate}
\item Door Operation
\label{sec-3-1-5-3}

The appropriate doors should open upon arriving at a station and close before leaving the station.
\begin{enumerate}
\item Validity checks on inputs
\label{sec-3-1-5-3-1}

In automatic mode, the doors are controlled automatically by the train when arriving to the station. 

In manual mode, the doors are controlled by the driver, and it is their responsibility to open/close the doors when arriving and leaving a station. In this mode, the user cannot open or close the doors unless the train's speed is 0 MPH. 
\item Exact sequence of operations
\label{sec-3-1-5-3-2}

When in manual mode, the driver can open/close the left and right doors of the train. When the driver chooses to open/close the doors, the train's speed must be 0 MPH. To prevent any injuries, the doors will not open if the speed of the train is greater than 0 MPH. 
\item Responses to abnormal situations
\label{sec-3-1-5-3-3}

If the doors are in the failure state, the driver cannot change the state of the doors, and must wait until the doors are fixed. 
\item Communication facilities
\label{sec-3-1-5-3-4}

The train model determines the state that the left and right doors are in. Whenever the state is changed it is sent to the train model.
\item Relationship of output to inputs
\label{sec-3-1-5-3-5}

When a door is changed from open to close, or vice versa, the new state is sent to the train and changes the state of the door to follow the new state. 

When a door is changed from open to close, or vice versa, the new state is updated on the Train Controller to display the state of the door.  
\item Input/Output sequences
\label{sec-3-1-5-3-6}

In manual mode, when a train is selected, the Train Controller will the display the states of the left and right doors based on the state determined from the train.

When the driver changes the state from the Train Controller, the new state is sent to the train, and the corresponding door is changed to the new state. 

In automatic mode, when a train is selected the Train Controller will display the states of the left and right doors based on the state determined from the train. 

In this mode, the doors are controlled by the train when arriving and leaving a station. Then the states are changed on the train, the state of the doors will be reflected on the Train Controller.
\end{enumerate}
\item Announcement System
\label{sec-3-1-5-4}

The upcoming station should be announced shortly before arriving at the station.
\begin{enumerate}
\item Validity checks on inputs
\label{sec-3-1-5-4-1}

In manual mode, the announcement must be picked from the list of available announcements, and cannot be empty when clicking the "Make Announcement" button. 
\item Exact sequence of operations
\label{sec-3-1-5-4-2}

In manual mode, the driver must choose the announcement from the Train Controller, and hit the "Make Announcement" button in order to send the message over the train's speaker system.

If no valid announcement is selected when the "Make Announcement" button is pressed, a window will appear stating that an error has occurred.  

In automatic mode, the train automatically makes announcements based on the next station and when arriving at the current station. 
\item Communication facilities
\label{sec-3-1-5-4-3}

The announcement made from the Train Controller must be sent through the train via the speaker system on the train. 
\item Relationship of output to inputs
\label{sec-3-1-5-4-4}

When the user chooses to make an announcement, the message is selected via the drop-down menu, and sent to the train. 
\item Input/Output sequences
\label{sec-3-1-5-4-5}

When the driver chooses the announcement from the drop-down and clicks the "Make Announcement" button, the message is sent to the train. The train should the broadcast the message via its speaker system. In automatic mode, the train automatically makes announcements through the speaker system.
\end{enumerate}
