work_reports/wp1/srs/srs.org
**** Operating Lights

The interior lights should be turned on at night and when in a tunnel.

They should be turned off at sunrise and when exiting a tunnel.
***** Validity checks on inputs

The time should be checked to make sure its in a valid format.
***** Exact sequence of operations

In manual mode, when the user changes the states of the lights from on to off, or vice versa, the new state of the light is sent to the train, which changes the state of the light to what was selected. 

When a train is selected, the states of the lights will be displayed to the Train Controller.
***** Responses to abnormal situations

If the user tries to change the state of the lights when they are in a failure state, a window will appear stating that the lights must first be fixed. 
***** Communication facilities

The states of the lights comes from the train. When the state of the lights are changed from the Train Controller, it is sent to the train. 

When the state of the lights on the train are changed, it is updated to the Train Controller as well. 
***** Error handling and recovery

If the lights are in a failure mode, they must first be fixed before they can be changed. Trying to change the lights while in a failure mode will not work, and will result in a error message. 
***** Relationship of output to inputs

The state of the lights are determined by the state of the lights on the train. 

When any state is changed from the Train Controller, it is sent to the train. 

When the state of the lights are changed on the train, the states are updated on the Train Controller to reflect the new state. 
***** Input/Output sequences

When a train is selected, the states of its lights will be reflected on the Train Controller GUI. When any changes are made by the train the new state is picked up by the Train Controller. 

When any changes are made by the Train Controller, the new state is sent to the train. 
**** Air Conditioning

The air conditioning should be turned on when the thermometer reaches a certain temperature, and off when the thermometer drops below a certain temperature.
***** Validity checks on inputs

In automatic mode, the air conditioning unit is controlled automatically by the train depending on the thermometer on the train. 

In manual mode, the set temperature can't be lower than AC will allow. If it is set lower it will default to the lowest allowed temperature.

The temperature is not able to be changed if you are in a failure mode.
***** Exact sequence of operations

In automatic mode, the air conditioning unit is turned on and off automatically depending on the temperature determined by the train's thermometer. The state of the air conditioning unit is sent and displayed by the Train Controller.  

In manual mode, the air conditioning unit is turned on and off by driver regardless of the temperature determined by the thermometer. When the user changes the state of the air conditioning unit, the new state is sent to the train.  
***** Responses to abnormal situations

If the air conditioning unit is in failure mode, the state cannot be changed until it is fixed. 
***** Communication facilities

Changing the state of the air conditioning unit sends the new state to the train. The temperature from the thermometer is sent to the Train Controller to control the air conditioning unit when in automatic mode. 
***** Error handling and recovery

If the air conditioning unit is in failure mode, it must be fixed before the states can be changed. 
***** Relationship of output to inputs

In manual mode, when the driver changes the state of the air conditioning unit, the state is sent to the train to control the state of the air conditioning unit. 

In automatic mode, the temperature from the train's thermometer is sent to the Train Controller, and based on its value, changes the state of the air conditioning unit. 
***** Input/Output sequences

In manual mode, the state of the selected train's air conditioning unit is displayed to the Train Controller. When the user changes the state of the air conditioning unit, the new state is sent to the train's air conditioning unit and is updated to mimic the new state. 

In automatic mode, the state of the selected train's air conditioning unit is displayed to the Train Controller. Using the thermometer on the train, the temperature is sent to the Train Controller. Based on the value of the temperature, the Train Controller will change the state of the air conditioning unit. The new state will then be sent to the train to update the air conditioning unit with the new state. 
***** Formulas for input to output conversion

The temperature is retrieved in Celsius, and must be converted to Fahrenheit. The equation is: F = (C)*1.8 + 32.  
**** Heating

The heating unit should be turned on when the thermometer drops below a certain temperature, and off when the thermometer reaches a certain temperature.
***** Validity checks on inputs

In automatic mode, the heating unit is controlled automatically based on the temperature read by the train's thermometer.

In manual mode, the set temperature can't be higher than heater will allow. If it is set higher, then it will default to the highest allowed temperature.

The temperature is not able to be changed if you are in a failure mode.
***** Exact sequence of operations

In automatic mode, the heating unit is turned on and off automatically depending on the temperature determined by the train's thermometer. The state of the heating unit is sent and displayed by the Train Controller.  

In manual mode, the heating unit is turned on and off by the driver regardless of the temperature determined by the thermometer. When the user changes the state of the heating unit, the new state is sent to the train.  
***** Responses to abnormal situations

If the heating unit is in failure mode, the state cannot be changed until it is fixed. 
***** Communication facilities

Changing the state of the heating unit sends the new state to the train. The temperature from the thermometer is sent to the Train Controller to control the heating unit when in automatic mode. 
***** Error handling and recovery

If the heating unit is in failure mode, it must be fixed before the states can be changed. 
***** Relationship of output to inputs

In manual mode, when the driver changes the state of the heating unit, the state is sent to the train to control the state of the heating unit.

In automatic mode, the temperature from the train's thermometer is sent to the Train Controller, and based on its value, changes the state of the heating unit. 
***** Input/Output sequences

In manual mode, the state of the selected train's heating unit is displayed to the Train Controller. When the user changes the state of the heating unit, the new state is sent to the train's heating unit.

In automatic mode, the state of the selected train's heating unit is displayed to the Train Controller. Using the thermometer on the train, the temperature is sent to the Train Controller. Based on the value of the temperature, the Train Controller will change the state of the heating unit. The new state will then be sent to the train to update the heating unit with the new state.
