work_reports/wp1/srs/srs.tex
\item Operating Lights
\label{sec-3-1-5-5}

The interior lights should be turned on at night and when in a tunnel.

They should be turned off at sunrise and when exiting a tunnel.
\begin{enumerate}
\item Validity checks on inputs
\label{sec-3-1-5-5-1}

The time should be checked to make sure its in a valid format.
\item Exact sequence of operations
\label{sec-3-1-5-5-2}

In manual mode, when the user changes the states of the lights from on to off, or vice versa, the new state of the light is sent to the train, which changes the state of the light to what was selected. 

When a train is selected, the states of the lights will be displayed to the Train Controller.
\item Responses to abnormal situations
\label{sec-3-1-5-5-3}

If the user tries to change the state of the lights when they are in a failure state, a window will appear stating that the lights must first be fixed. 
\item Communication facilities
\label{sec-3-1-5-5-4}

The states of the lights comes from the train. When the state of the lights are changed from the Train Controller, it is sent to the train. 

When the state of the lights on the train are changed, it is updated to the Train Controller as well. 
\item Error handling and recovery
\label{sec-3-1-5-5-5}

If the lights are in a failure mode, they must first be fixed before they can be changed. Trying to change the lights while in a failure mode will not work, and will result in a error message. 
\item Relationship of output to inputs
\label{sec-3-1-5-5-6}

The state of the lights are determined by the state of the lights on the train. 

When any state is changed from the Train Controller, it is sent to the train. 

When the state of the lights are changed on the train, the states are updated on the Train Controller to reflect the new state. 
\item Input/Output sequences
\label{sec-3-1-5-5-7}

When a train is selected, the states of its lights will be reflected on the Train Controller GUI. When any changes are made by the train the new state is picked up by the Train Controller. 

When any changes are made by the Train Controller, the new state is sent to the train.
\end{enumerate}
\item Air Conditioning
\label{sec-3-1-5-6}

The air conditioning should be turned on when the thermometer reaches a certain temperature, and off when the thermometer drops below a certain temperature.
\begin{enumerate}
\item Validity checks on inputs
\label{sec-3-1-5-6-1}

In automatic mode, the air conditioning unit is controlled automatically by the train depending on the thermometer on the train. 

In manual mode, the set temperature can't be lower than AC will allow. If it is set lower it will default to the lowest allowed temperature.

The temperature is not able to be changed if you are in a failure mode.
\item Exact sequence of operations
\label{sec-3-1-5-6-2}

In automatic mode, the air conditioning unit is turned on and off automatically depending on the temperature determined by the train's thermometer. The state of the air conditioning unit is sent and displayed by the Train Controller.  

In manual mode, the air conditioning unit is turned on and off by driver regardless of the temperature determined by the thermometer. When the user changes the state of the air conditioning unit, the new state is sent to the train.  
\item Responses to abnormal situations
\label{sec-3-1-5-6-3}

If the air conditioning unit is in failure mode, the state cannot be changed until it is fixed. 
\item Communication facilities
\label{sec-3-1-5-6-4}

Changing the state of the air conditioning unit sends the new state to the train. The temperature from the thermometer is sent to the Train Controller to control the air conditioning unit when in automatic mode. 
\item Error handling and recovery
\label{sec-3-1-5-6-5}

If the air conditioning unit is in failure mode, it must be fixed before the states can be changed. 
\item Relationship of output to inputs
\label{sec-3-1-5-6-6}

In manual mode, when the driver changes the state of the air conditioning unit, the state is sent to the train to control the state of the air conditioning unit. 

In automatic mode, the temperature from the train's thermometer is sent to the Train Controller, and based on its value, changes the state of the air conditioning unit. 
\item Input/Output sequences
\label{sec-3-1-5-6-7}

In manual mode, the state of the selected train's air conditioning unit is displayed to the Train Controller. When the user changes the state of the air conditioning unit, the new state is sent to the train's air conditioning unit and is updated to mimic the new state. 

In automatic mode, the state of the selected train's air conditioning unit is displayed to the Train Controller. Using the thermometer on the train, the temperature is sent to the Train Controller. Based on the value of the temperature, the Train Controller will change the state of the air conditioning unit. The new state will then be sent to the train to update the air conditioning unit with the new state. 
\item Formulas for input to output conversion
\label{sec-3-1-5-6-8}

The temperature is retrieved in Celsius, and must be converted to Fahrenheit. The equation is: F = (C)*1.8 + 32.
\end{enumerate}
\item Heating
\label{sec-3-1-5-7}

The heating unit should be turned on when the thermometer drops below a certain temperature, and off when the thermometer reaches a certain temperature.
\begin{enumerate}
\item Validity checks on inputs
\label{sec-3-1-5-7-1}

In automatic mode, the heating unit is controlled automatically based on the temperature read by the train's thermometer.

In manual mode, the set temperature can't be higher than heater will allow. If it is set higher, then it will default to the highest allowed temperature.

The temperature is not able to be changed if you are in a failure mode.
\item Exact sequence of operations
\label{sec-3-1-5-7-2}

In automatic mode, the heating unit is turned on and off automatically depending on the temperature determined by the train's thermometer. The state of the heating unit is sent and displayed by the Train Controller.  

In manual mode, the heating unit is turned on and off by the driver regardless of the temperature determined by the thermometer. When the user changes the state of the heating unit, the new state is sent to the train.  
\item Responses to abnormal situations
\label{sec-3-1-5-7-3}

If the heating unit is in failure mode, the state cannot be changed until it is fixed. 
\item Communication facilities
\label{sec-3-1-5-7-4}

Changing the state of the heating unit sends the new state to the train. The temperature from the thermometer is sent to the Train Controller to control the heating unit when in automatic mode. 
\item Error handling and recovery
\label{sec-3-1-5-7-5}

If the heating unit is in failure mode, it must be fixed before the states can be changed. 
\item Relationship of output to inputs
\label{sec-3-1-5-7-6}

In manual mode, when the driver changes the state of the heating unit, the state is sent to the train to control the state of the heating unit.

In automatic mode, the temperature from the train's thermometer is sent to the Train Controller, and based on its value, changes the state of the heating unit. 
\item Input/Output sequences
\label{sec-3-1-5-7-7}

In manual mode, the state of the selected train's heating unit is displayed to the Train Controller. When the user changes the state of the heating unit, the new state is sent to the train's heating unit.

In automatic mode, the state of the selected train's heating unit is displayed to the Train Controller. Using the thermometer on the train, the temperature is sent to the Train Controller. Based on the value of the temperature, the Train Controller will change the state of the heating unit. The new state will then be sent to the train to update the heating unit with the new state.
\item Formulas for input to output conversion
\label{sec-3-1-5-7-8}

The temperature is retrieved in Celsius, and must be converted to Fahrenheit. The equation is: F = (C)*1.8 + 32.
\end{enumerate}

\item Communication
\label{sec-3-1-5-8}
\begin{enumerate}
\item Inputs
\label{sec-3-1-5-8-1}
\begin{enumerate}
\item Suggested Speed
\label{sec-3-1-5-8-1-1}
\begin{enumerate}
\item Used for?
\label{sec-3-1-5-8-1-1-1}

Suggested speed is used to determine the speed of the train. If in manual mode, the train cannot go faster than the suggested speed. 
\item Checks to do
\label{sec-3-1-5-8-1-1-2}
