work_reports/wp1/srs/srs.org
***** Formulas for input to output conversion

The temperature is retrieved in Celsius, and must be converted to Fahrenheit. The equation is: F = (C)*1.8 + 32.

**** Communication
***** Inputs 
****** Suggested Speed
******* Used for?

Suggested speed is used to determine the speed of the train. If in manual mode, the train cannot go faster than the suggested speed. 
******* Checks to do

Checks to make sure that the suggested speed is not higher than the block speed. If it is, then the suggested speed is ignored. 
******* From where?

The suggested speed is determined from the train model, who gets the suggested speed from the track model. The suggested speed is set by the CTC.  
****** Block Speed
******* Used for?

In manual mode, block speed is used to determine the max speed the driver can set the speed of the train to.
******* Checks to do

Checks to make sure that the speed of the train and/or the set speed is not greater than the block speed. 
******* From where?

The block speed is determined by the current block the train is in. This is determined by the GPS on board the train. 
****** Authority
******* Used for?

Authority is used to determine how far (in distance) the train is permitted to travel.
******* Checks to do

Check to make sure that the authority does not contain any alphanumeric (A-Z, a-z) or special characters (%, !, *, etc..).
******* From where?

Authority is picked up by the train model from the track. The authority is initially set by the dispatcher.  
****** Kp
******* Used for?

Used to determine the power the train must produce to reach the set speed. 
******* From where?

Kp is set by the engineers, and can be configured from the train controller GUI. 
****** Ki
******* Used for?

Used to determine the power the train must produced to reach the set speed.  
******* From where?

Ki is set by the engineers, and can be configured from the train controller GUI. 
***** Outputs 
****** Train's Set Speed
******* Used for?

Used to set a new speed for the selected train.
****** Initiate Emergency Brake
******* Used for?

Used to initiate the emergency brake of the selected train.
******* To where?

Sends a signal to the train's brake control unit to initiate the emergency brakes on the train. 
****** Initiate Service Brake
******* Used for?

Used to initiate the service brakes of the selected train.
******* To where?

Sends a signal to the train's brake control unit to initiate the service brakes on the train. 
**** Failure Modes

The Train Controller relays the failures of the selected train to the user. If in manual mode, the driver can send a request to fix the failure. If in automatic mode, the train will automatically dispatch a request to fix the failures when they occur. 
***** Antenna Failure: 
****** What does it mean?

An antenna failure means that the antenna on the train is not working properly or communication between the antenna is broken.  
****** When does it occur?

An antenna failure occurs when the antenna no longer sends a signal.
****** Which modules are affected?

The train model, and MBO and Scheduler are affected by the failure since there is no longer a way to get information to and from the train. 
****** How do you recover?

The CTC must dispatch a repair crew to go out to the train and fix the train.
Once the repair is made, the signal from the antenna will be picked up again, and will be reflected to the Train Controller.

In manual mode, the user must manually send a request to fix the antenna. 

In automatic mode, when the failure is detected, the Train Controller will automatically send a request to the CTC.  

***** Brake Failure: 
****** What does it mean?

Brake failure indicates that the brakes on the train no longer are operational. 
****** Which modules are affected?

The train model is affected by the failure since there is no longer a way to stop the train.
****** How do you recover?

The CTC must dispatch a repair crew to go out to the train and fix the train. 

In manual mode, the driver must manually send a request to fix the antenna. 

In automatic mode, the Train Controller will automatically send a request to the CTC to send a repair crew when the failure is detected. 

***** Power Failure:
****** What does it mean?

Power failure means that the utilities on the train (A/C, Heat, Lights, and Doors) are no longer operational. These utilities will be displayed in the failure state on the Train Controller. 
****** Which modules are affected?

The train model is affected by this failure since there is no way to control the train's utilities. 
****** How do you recover?

The CTC must dispatch a repair crew to go out to the train and fix the train. 
Once the repair is made, the signal from the utilities will be picked up again, and will be reflected to the Train Controller.

In manual mode, the driver must manually send a request to fix the utilities. 

In automatic mode, the Train Controller will automatically send a request to the CTC to send a repair crew when the failure is detected. 
*** Scheduler/MBO
**** Schedules
***** Create Driver Schedule

A schedule for the train drivers should be created from the given input.

The user can provide an expected throughput and the minimum number of drivers should be returned.

The user can enter in a number of drivers and the MBO should notify the user whether or not that is sufficient to handle the throughput.
****** Validity checks on inputs

The throughput will be checked to make sure that it contains digits (0-9), and does not contain any alphanumeric (A-Z), or special (&,*,!,@, etc..) characters.  

If the number of drivers is not sufficient to support the throughput, the user should be notified.

The user should be notified if the throughput they entered was negative or too high for the system to handle.
****** Exact sequence of operations

The user should first request a throughput. A train schedule will be generated based upon the track information. The driver' schedules will be created based upon the train schedule.
****** Communication facilities

Gets the throughput from the user.
***** Create Train Schedule

A schedule for the trains should be created from the given input taken from the excel file, taking into account increased demand at rush hours.
****** Validity checks on inputs

The input should be checked to make sure that each train completes its route in a cycle.
****** Exact sequence of operations

Route times should be checked to find the minimum number of trains necessary to make the schedule.

Trains should be checked to make sure they are within safe braking distance.
A schedule for the trains should be created from the given input taken from the excel file, taking into account increased demand at rush hours.
****** Responses to abnormal situations

Trains should return to the yard at to add cars before rush hour, and remove cars after rush hour.
****** Communication facilities

The user will load an excel file of the train routes before the program starts.
