work_reports/wp1/srs/srs.tex

Checks to make sure that the suggested speed is not higher than the block speed. If it is, then the suggested speed is ignored. 
\item From where?
\label{sec-3-1-5-8-1-1-3}

The suggested speed is determined from the train model, who gets the suggested speed from the track model. The suggested speed is set by the CTC.
\end{enumerate}
\item Block Speed
\label{sec-3-1-5-8-1-2}
\begin{enumerate}
\item Used for?
\label{sec-3-1-5-8-1-2-1}

In manual mode, block speed is used to determine the max speed the driver can set the speed of the train to.
\item Checks to do
\label{sec-3-1-5-8-1-2-2}

Checks to make sure that the speed of the train and/or the set speed is not greater than the block speed. 
\item From where?
\label{sec-3-1-5-8-1-2-3}

The block speed is determined by the current block the train is in. This is determined by the GPS on board the train.
\end{enumerate}
\item Authority
\label{sec-3-1-5-8-1-3}
\begin{enumerate}
\item Used for?
\label{sec-3-1-5-8-1-3-1}

Authority is used to determine how far (in distance) the train is permitted to travel.
\item Checks to do
\label{sec-3-1-5-8-1-3-2}

Check to make sure that the authority does not contain any alphanumeric (A-Z, a-z) or special characters (\%, !, *, etc..).
\item From where?
\label{sec-3-1-5-8-1-3-3}

Authority is picked up by the train model from the track. The authority is initially set by the dispatcher.
\end{enumerate}
\item Kp
\label{sec-3-1-5-8-1-4}
\begin{enumerate}
\item Used for?
\label{sec-3-1-5-8-1-4-1}

Used to determine the power the train must produce to reach the set speed. 
\item From where?
\label{sec-3-1-5-8-1-4-2}

Kp is set by the engineers, and can be configured from the train controller GUI.
\end{enumerate}
\item Ki
\label{sec-3-1-5-8-1-5}
\begin{enumerate}
\item Used for?
\label{sec-3-1-5-8-1-5-1}

Used to determine the power the train must produced to reach the set speed.  
\item From where?
\label{sec-3-1-5-8-1-5-2}

Ki is set by the engineers, and can be configured from the train controller GUI.
\end{enumerate}
\end{enumerate}
\item Outputs
\label{sec-3-1-5-8-2}
\begin{enumerate}
\item Train's Set Speed
\label{sec-3-1-5-8-2-1}
\begin{enumerate}
\item Used for?
\label{sec-3-1-5-8-2-1-1}

Used to set a new speed for the selected train.
\end{enumerate}
\item Initiate Emergency Brake
\label{sec-3-1-5-8-2-2}
\begin{enumerate}
\item Used for?
\label{sec-3-1-5-8-2-2-1}

Used to initiate the emergency brake of the selected train.
\item To where?
\label{sec-3-1-5-8-2-2-2}

Sends a signal to the train's brake control unit to initiate the emergency brakes on the train.
\end{enumerate}
\item Initiate Service Brake
\label{sec-3-1-5-8-2-3}
\begin{enumerate}
\item Used for?
\label{sec-3-1-5-8-2-3-1}

Used to initiate the service brakes of the selected train.
\item To where?
\label{sec-3-1-5-8-2-3-2}

Sends a signal to the train's brake control unit to initiate the service brakes on the train.
\end{enumerate}
\end{enumerate}
\end{enumerate}
\item Failure Modes
\label{sec-3-1-5-9}

The Train Controller relays the failures of the selected train to the user. If in manual mode, the driver can send a request to fix the failure. If in automatic mode, the train will automatically dispatch a request to fix the failures when they occur. 
\begin{enumerate}
\item Antenna Failure:
\label{sec-3-1-5-9-1}
\begin{enumerate}
\item What does it mean?
\label{sec-3-1-5-9-1-1}

An antenna failure means that the antenna on the train is not working properly or communication between the antenna is broken.  
\item When does it occur?
\label{sec-3-1-5-9-1-2}

An antenna failure occurs when the antenna no longer sends a signal.
\item Which modules are affected?
\label{sec-3-1-5-9-1-3}

The train model, and MBO and Scheduler are affected by the failure since there is no longer a way to get information to and from the train. 
\item How do you recover?
\label{sec-3-1-5-9-1-4}

The CTC must dispatch a repair crew to go out to the train and fix the train.
Once the repair is made, the signal from the antenna will be picked up again, and will be reflected to the Train Controller.

In manual mode, the user must manually send a request to fix the antenna. 

In automatic mode, when the failure is detected, the Train Controller will automatically send a request to the CTC.
\end{enumerate}

\item Brake Failure:
\label{sec-3-1-5-9-2}
\begin{enumerate}
\item What does it mean?
\label{sec-3-1-5-9-2-1}

Brake failure indicates that the brakes on the train no longer are operational. 
\item Which modules are affected?
\label{sec-3-1-5-9-2-2}

The train model is affected by the failure since there is no longer a way to stop the train.
\item How do you recover?
\label{sec-3-1-5-9-2-3}

The CTC must dispatch a repair crew to go out to the train and fix the train. 

In manual mode, the driver must manually send a request to fix the antenna. 

In automatic mode, the Train Controller will automatically send a request to the CTC to send a repair crew when the failure is detected.
\end{enumerate}

\item Power Failure:
\label{sec-3-1-5-9-3}
\begin{enumerate}
\item What does it mean?
\label{sec-3-1-5-9-3-1}

Power failure means that the utilities on the train (A/C, Heat, Lights, and Doors) are no longer operational. These utilities will be displayed in the failure state on the Train Controller. 
\item Which modules are affected?
\label{sec-3-1-5-9-3-2}

The train model is affected by this failure since there is no way to control the train's utilities. 
\item How do you recover?
\label{sec-3-1-5-9-3-3}

The CTC must dispatch a repair crew to go out to the train and fix the train. 
Once the repair is made, the signal from the utilities will be picked up again, and will be reflected to the Train Controller.

In manual mode, the driver must manually send a request to fix the utilities. 

In automatic mode, the Train Controller will automatically send a request to the CTC to send a repair crew when the failure is detected.
\end{enumerate}
\end{enumerate}
\end{enumerate}
\subsubsection{Scheduler/MBO}
\label{sec-3-1-6}
\begin{enumerate}
\item Schedules
\label{sec-3-1-6-1}
\begin{enumerate}
\item Create Driver Schedule
\label{sec-3-1-6-1-1}

A schedule for the train drivers should be created from the given input.

The user can provide an expected throughput and the minimum number of drivers should be returned.

The user can enter in a number of drivers and the MBO should notify the user whether or not that is sufficient to handle the throughput.
\begin{enumerate}
\item Validity checks on inputs
\label{sec-3-1-6-1-1-1}

The throughput will be checked to make sure that it contains digits (0-9), and does not contain any alphanumeric (A-Z), or special (\&,*,!,@, etc..) characters.  

If the number of drivers is not sufficient to support the throughput, the user should be notified.

The user should be notified if the throughput they entered was negative or too high for the system to handle.
\item Exact sequence of operations
\label{sec-3-1-6-1-1-2}

The user should first request a throughput. A train schedule will be generated based upon the track information. The driver' schedules will be created based upon the train schedule.
\item Communication facilities
\label{sec-3-1-6-1-1-3}

Gets the throughput from the user.
\end{enumerate}
\item Create Train Schedule
\label{sec-3-1-6-1-2}

A schedule for the trains should be created from the given input taken from the excel file, taking into account increased demand at rush hours.
\begin{enumerate}
\item Validity checks on inputs
\label{sec-3-1-6-1-2-1}

The input should be checked to make sure that each train completes its route in a cycle.
\item Exact sequence of operations
\label{sec-3-1-6-1-2-2}

Route times should be checked to find the minimum number of trains necessary to make the schedule.

Trains should be checked to make sure they are within safe braking distance.
A schedule for the trains should be created from the given input taken from the excel file, taking into account increased demand at rush hours.
\item Responses to abnormal situations
\label{sec-3-1-6-1-2-3}

Trains should return to the yard at to add cars before rush hour, and remove cars after rush hour.
\item Communication facilities
\label{sec-3-1-6-1-2-4}

The user will load an excel file of the train routes before the program starts.
\end{enumerate}
