work_reports/wp1/srs/srs.org
***** Display Driver Schedule

The driver's schedules that was created should be displayed and view-able through the office. Key should be included to help interpret.
****** Exact sequence of operations

The data should be read in from how it was stored. It should be interpreted and loaded into the GUI for display.
***** Display Train Schedule

The trains' schedules that was created should be displayed and view-able through the office. Key should be included to help interpret.
****** Exact sequence of operations

The data should be read in from how it was stored. It should be interpreted and loaded into the GUI for display.
**** Monitor Trains

All trains and their variance should be displayed.
****** Exact sequence of operations

The GPS data of the trains should be displayed.

The variance between this GPS data and their scheduled data should be displayed.
****** Communication facilities

All track/block information as well as the speed/authority/GPS location of trains comes from the wayside controller.
**** Switch Mode

The MBO will have to handle setting things up when the mode is changed by the CTC.
***** Exact sequence of operations

When switching from MBO mode to fixed block overlay mode the track is checked to see whether two or more trains are in the same block. If they are not, the mode is switched to MBO mode. If they are, a "shutdown" procedure will have to occur before the mode can be switched. In order to make the switch over no two trains can be in the same block. The speeds and authorities of the trains should be adjusted so that the trains are spread out to no more than one per block. Once this is done, control is transferred to fix block mode.

When switching from fixed block overlay mode to MBO mode, control can be transferred immediately.
***** Communication facilities

The CTC will have to provide the MBO with the locations of the trains.
**** Communication
***** Inputs 
****** Mode
******* From where?

CTC
******* Used for?

Determine whether schedule is in MBO mode.
****** Train Information
******* From where?

Trains
******* Used for?

Monitoring/Displaying trains
***** Outputs 
****** Schedule
******* Used for?

Displaying to dispatcher. 
******* To where?

CTC
****** Speed/Authority
******* To where?

CTC
******* Used for?

Giving a suggestion of speed and authority to wayside to communicate to trains.
** Non-functional Requirements
*** Performance
1. The system should be capable of running at wall-clock time.
2. The system should be capable of running at 10 times speed.
3. The system should have an automatic mode with scenarios in order to demo the system.
*** Reliability
1. The system must be safety critical.
*** Availability
1. The program must be able to run on Windows 10 with Java 8 installed.
2. The program can be run from it's executable JAR file.
*** Security
The computer that this program will be running on is expected to have its own security. No special protection was built into this application.

*** Maintainability
The system shall be maintained until April 27, 2016.

Each module should be capable of functioning on its own.
*** Portability
The program will be able to run on Windows 10 with Java 8 installed.
** Logical Database Requirements
The data for the track model shall be input in to the system through an excel document. We will have a python script parse this file and insert it into a database. This database should then provide the necessary information to the appropriate modules.
** Design Constraints

1. The system shall be submitted as an executable.
2. The executable should be able to run on Windows 10.
3. The system is to be coded primarily in Java, with Python to help with scripting. 
4. Each module will have a Graphical User Interface (GUI) for ease of use.
5. Its user interface was created using Eclipse's WindowBuilder plug-in.
6. The system must be adaptable for different track layouts.
7. The system is a safety critical application.

* Appendices
** User Interface Diagrams

See the user manual for detailed user interface diagrams.



