work_reports/wp1/srs/srs.tex
\item Display Driver Schedule
\label{sec-3-1-6-1-3}

The driver's schedules that was created should be displayed and view-able through the office. Key should be included to help interpret.
\begin{enumerate}
\item Exact sequence of operations
\label{sec-3-1-6-1-3-1}

The data should be read in from how it was stored. It should be interpreted and loaded into the GUI for display.
\end{enumerate}
\item Display Train Schedule
\label{sec-3-1-6-1-4}

The trains' schedules that was created should be displayed and view-able through the office. Key should be included to help interpret.
\begin{enumerate}
\item Exact sequence of operations
\label{sec-3-1-6-1-4-1}

The data should be read in from how it was stored. It should be interpreted and loaded into the GUI for display.
\end{enumerate}
\end{enumerate}
\item Monitor Trains
\label{sec-3-1-6-2}

All trains and their variance should be displayed.
\begin{enumerate}
\item Exact sequence of operations
\label{sec-3-1-6-2-0-1}

The GPS data of the trains should be displayed.

The variance between this GPS data and their scheduled data should be displayed.
\item Communication facilities
\label{sec-3-1-6-2-0-2}

All track/block information as well as the speed/authority/GPS location of trains comes from the wayside controller.
\end{enumerate}
\item Switch Mode
\label{sec-3-1-6-3}

The MBO will have to handle setting things up when the mode is changed by the CTC.
\begin{enumerate}
\item Exact sequence of operations
\label{sec-3-1-6-3-1}

When switching from MBO mode to fixed block overlay mode the track is checked to see whether two or more trains are in the same block. If they are not, the mode is switched to MBO mode. If they are, a "shutdown" procedure will have to occur before the mode can be switched. In order to make the switch over no two trains can be in the same block. The speeds and authorities of the trains should be adjusted so that the trains are spread out to no more than one per block. Once this is done, control is transferred to fix block mode.

When switching from fixed block overlay mode to MBO mode, control can be transferred immediately.
\item Communication facilities
\label{sec-3-1-6-3-2}

The CTC will have to provide the MBO with the locations of the trains.
\end{enumerate}
\item Communication
\label{sec-3-1-6-4}
\begin{enumerate}
\item Inputs
\label{sec-3-1-6-4-1}
\begin{enumerate}
\item Mode
\label{sec-3-1-6-4-1-1}
\begin{enumerate}
\item From where?
\label{sec-3-1-6-4-1-1-1}

CTC
\item Used for?
\label{sec-3-1-6-4-1-1-2}

Determine whether schedule is in MBO mode.
\end{enumerate}
\item Train Information
\label{sec-3-1-6-4-1-2}
\begin{enumerate}
\item From where?
\label{sec-3-1-6-4-1-2-1}

Trains
\item Used for?
\label{sec-3-1-6-4-1-2-2}

Monitoring/Displaying trains
\end{enumerate}
\end{enumerate}
\item Outputs
\label{sec-3-1-6-4-2}
\begin{enumerate}
\item Schedule
\label{sec-3-1-6-4-2-1}
\begin{enumerate}
\item Used for?
\label{sec-3-1-6-4-2-1-1}

Displaying to dispatcher. 
\item To where?
\label{sec-3-1-6-4-2-1-2}

CTC
\end{enumerate}
\item Speed/Authority
\label{sec-3-1-6-4-2-2}
\begin{enumerate}
\item To where?
\label{sec-3-1-6-4-2-2-1}

CTC
\item Used for?
\label{sec-3-1-6-4-2-2-2}

Giving a suggestion of speed and authority to wayside to communicate to trains.
\end{enumerate}
\end{enumerate}
\end{enumerate}
\end{enumerate}
\subsection{Non-functional Requirements}
\label{sec-3-2}
\subsubsection{Performance}
\label{sec-3-2-1}
\begin{enumerate}
\item The system should be capable of running at wall-clock time.
\item The system should be capable of running at 10 times speed.
\item The system should have an automatic mode with scenarios in order to demo the system.
\end{enumerate}
\subsubsection{Reliability}
\label{sec-3-2-2}
\begin{enumerate}
\item The system must be safety critical.
\end{enumerate}
\subsubsection{Availability}
\label{sec-3-2-3}
\begin{enumerate}
\item The program must be able to run on Windows 10 with Java 8 installed.
\item The program can be run from it's executable JAR file.
\end{enumerate}
\subsubsection{Security}
\label{sec-3-2-4}
The computer that this program will be running on is expected to have its own security. No special protection was built into this application.

\subsubsection{Maintainability}
\label{sec-3-2-5}
The system shall be maintained until April 27, 2016.

Each module should be capable of functioning on its own.
\subsubsection{Portability}
\label{sec-3-2-6}
The program will be able to run on Windows 10 with Java 8 installed.
\subsection{Logical Database Requirements}
\label{sec-3-3}
The data for the track model shall be input in to the system through an excel document. We will have a python script parse this file and insert it into a database. This database should then provide the necessary information to the appropriate modules.
\subsection{Design Constraints}
\label{sec-3-4}

\begin{enumerate}
\item The system shall be submitted as an executable.
\item The executable should be able to run on Windows 10.
\item The system is to be coded primarily in Java, with Python to help with scripting.
\item Each module will have a Graphical User Interface (GUI) for ease of use.
\item Its user interface was created using Eclipse's WindowBuilder plug-in.
\item The system must be adaptable for different track layouts.
\item The system is a safety critical application.
\end{enumerate}

\section{Appendices}
\label{sec-4}
\subsection{User Interface Diagrams}
\label{sec-4-1}

See the user manual for detailed user interface diagrams.
% Emacs 24.5.1 (Org mode 8.2.10)
\end{document}
